import React, { useRef } from 'react';
import { useReactToPrint } from 'react-to-print';
import styled from 'styled-components';

const ASCII_TITLE = [
    '     ▄████████    ▄█   ▄█▄    ▄████████     ███        ▄████████       ▄█     █▄   ▄█      ███      ▄████████    ▄█    █▄       ▄████████    ▄████████ ',
    '    ███    ███   ███ ▄███▀   ███    ███ ▀█████████▄   ███    ███      ███     ███ ███  ▀█████████▄ ███    ███   ███    ███     ███    ███   ███    ███ ',
    '    ███    █▀    ███▐██▀     ███    ███    ▀███▀▀██   ███    █▀       ███     ███ ███▌    ▀███▀▀██ ███    █▀    ███    ███     ███    █▀    ███    █▀  ',
    '    ███         ▄█████▀      ███    ███     ███   ▀  ▄███▄▄▄          ███     ███ ███▌     ███   ▀ ███         ▄███▄▄▄▄███▄▄  ▄███▄▄▄       ███        ',
    '  ▀███████████ ▀▀█████▄    ▀███████████     ███     ▀▀███▀▀▀          ███     ███ ███▌     ███     ███        ▀▀███▀▀▀▀███▀  ▀▀███▀▀▀     ▀███████████ ',
    '           ███   ███▐██▄     ███    ███     ███       ███    █▄       ███     ███ ███      ███     ███    █▄    ███    ███     ███    █▄           ███ ',
    '     ▄█    ███   ███ ▀███▄   ███    ███     ███       ███    ███      ███ ▄█▄ ███ ███      ███     ███    ███   ███    ███     ███    ███    ▄█    ███ ',
    '   ▄████████▀    ███   ▀█▀   ███    █▀     ▄████▀     ██████████       ▀███▀███▀  █▀      ▄████▀   ████████▀    ███    █▀      ██████████  ▄████████▀  ',
    '                 ▀                                                                                                                                     ',
].join('\n');
const ASCII_WITCH = [
    '    ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡆⠀⠀⠀⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⠀⠀⠀⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⡿⠀⠀⠀⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀⢀⣠⣾⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⣀⣀⣤⣴⣾⣿⣿⣿⣿⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⠀⢀⣀⣠⣤⣶⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
    '⠀⠀⣀⣤⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠋⠁⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
    '⢠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⢀⣴⠆⠀⠻⢦⣄⠀⠀⠀⠀⠀⠀⠀⠀',
    '⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠈⠑⠶⢦⣤⡘⢿⣧⡀⠀⠀⠀⠀⠀⠀',
    '⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠛⠛⠛⠻⠿⠿⠿⠿⠿⠿⠿⠛⣻⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢻⣾⣿⣿⣇⠀⠀⠀⠀⠀',
    '⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀⠀⠄⠀⠀⠀⢠⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢻⣿⣿⣿⡄⠀⠀⠀⠀',
    '⢸⣿⣿⣿⣿⣿⣿⡿⠟⣿⣿⡿⠿⢿⣿⣿⣿⣿⣿⣿⣿⣷⡀⠀⢤⣄⣠⣴⡶⠃⠀⣠⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⡇⠀⠀⠀⠀',
    '⠸⠿⠿⠿⠟⠛⠉⠀⢠⡟⠁⠀⢠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠀⠈⠉⠁⠀⠀⣴⣿⣿⣿⣿⡄⠀⠀⠢⢴⣶⣶⣄⠀⠀⠀⣸⣿⣿⣿⡇⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⠀⠀⠀⢸⣇⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣤⣤⣴⣾⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠈⠙⢿⣷⣤⣴⣿⣿⣿⣿⡇⠀⠀⠀⠀',
    '⠀⠀⠀⠀⠀⢀⣀⣤⣤⣈⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠙⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀',
    '⠀⠀⢀⣤⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣦⣄⡀⠀⠈⠻⣿⣿⣿⣿⡇⠀⠀⠀⠀',
    '⢠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⠀⣠⣿⣿⣿⣿⡇⠀⠀⠀⠀',
    '⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣼⣿⣿⣿⣿⣿⣇⠀⠀⠀⠀',
    '⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀',
    '⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠀⠀',
    '⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀',
    '⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀',
    '⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧',
].join('\n');

const ASCII_RAIN = [
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ',
    ' ｀、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽ ｀、ヽ｀ヽ｀、ヽ、ヽ',
].join('\n');

const ASCII_STARS = [
    '    .                      .',
    '    .                      ;',
    '    :                  - --+- -',
    '    !           .          !',
    '    |        .             .',
    '    |_         +',
    ' ,  | `.',
    '--- --+-<#>-+- ---  --  -',
    ' ._ |_,',
    '    T',
    '    |',
    '    !',
    '    :         . : ',
    '    .       *',
].join('\n');

const ASCII_SATURN = [
    '                                          _.oo.',
    '                 _.u[[/;:,.         .odMMMMMM',
    '              .o888UU[[[/;:-.  .o@P^    MMM^',
    '             oN88888UU[[[/;::-.        dP^',
    '            dNMMNN888UU[[[/;:--.   .o@P^',
    '           ,MMMMMMN888UU[[/;::-. o@^',
    '           NNMMMNN888UU[[[/~.o@P^',
    '           888888888UU[[[/o@^-..',
    '          oI8888UU[[[/o@P^:--..',
    '       .@^  YUU[[[/o@^;::---..',
    '     oMP     ^/o@P^;:::---..',
    '  .dMMM    .o@^ ^;::---...',
    ' dMMMMMMM@^`       `^^^^',
    'YMMMUP^',
    ' ^^',
].join('\n');

const StyledPrint = styled.div``;

const StyledTextToPrint = styled.div`
    display: none;
    @media print {
        display: block;
    }
`;

class ComponentToPrint extends React.PureComponent {
    render() {
        return (
            <StyledTextToPrint>
                <div style={{ position: 'absolute' }}>{ASCII_RAIN}</div>
                <div>♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰</div>
                <pre style={{ position: 'absolute' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '400px', left: '90px' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '100px', right: '200px' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '500px', right: '30px' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '600px', left: '300px' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '900px', left: '100px' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '1000px', left: '600px' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '400px', right: '100px' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '200px', left: '900px' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '1200px', left: '130px' }}>{ASCII_STARS}</pre>
                <pre style={{ position: 'absolute', top: '700px', left: '60px' }}>{ASCII_STARS}</pre>
                <pre style={{ marginTop: '100px' }}>{ASCII_SATURN}</pre>
                <pre style={{ marginLeft: '25%', paddingTop: '300px' }}>{ASCII_WITCH}</pre>
                <pre style={{ marginTop: '100px' }}>{ASCII_TITLE}</pre>
                <div style={{ position: 'absolute', bottom: '5px' }}>
                    ♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰♰
                </div>
            </StyledTextToPrint>
        );
    }
}

const PrintLink = () => {
    const componentRef = useRef(null);
    const handlePrint = useReactToPrint({
        content: () => componentRef.current,
        copyStyles: false,
    });

    return (
        <StyledPrint onClick={() => handlePrint()}>
            <ComponentToPrint ref={componentRef} />
            <div>Print</div>
        </StyledPrint>
    );
};

export default PrintLink;
